app/controllers/api/quotes_controller.rb

  def show
    @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def index
    @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"